DataProcessors/ПеремещениеТовараИзЯчейки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПеремещениеТовараИзЯчейки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОткуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОткудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеИзЯчейкиМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПеремещениеТовараИзЯчейки/Forms/ФормаТоварыВвыбранныхЯчейках/Ext/Form/Module.bsl
&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем РежимВводаАвтоматический;
&НаКлиенте
Перем Ошибка;
&НаКлиенте
Перем ПолученыДанныеИзЯчейкиОткуда;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ЯчейкаКуда = Параметры.ЯчейкаКуда;
	Объект.ЯчейкаКудаГУИД = Параметры.ЯчейкаКудаГУИД;
	Объект.ЯчейкаОткуда = Параметры.ЯчейкаОткуда;
	Объект.ЯчейкаОткудаГУИД = Параметры.ЯчейкаОткудаГУИД;
	
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокТоваровЯчейки");
	
КонецПроцедуры

&НаКлиенте
Процедура НайстроитьСвойстваЭлементовФормы()
	
	ПодчинМеню = Элементы.СписокТоваровВБуфереПеремещенияОткуда.КонтекстноеМеню.ПодчиненныеЭлементы;
	
	Если Параметры.ТипСобытия <> Неопределено И  Параметры.ТипСобытия = "ОбработатьНеизвестныйШтрихкод" Тогда
		Элементы.ГруппаСтраница_ТоварыВячейкахКуда.Видимость = Ложь;
		Элементы.ГруппаСтраница_ТоварыВячейкахКуда.Доступность = Ложь;		
		
		Если Параметры.СобытиеПрисвоитьШтрихкод = Истина Тогда
			ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПрисвоенияШК.Видимость = Истина;	
			ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПеремещения.Видимость= Ложь;
		Иначе
			ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПрисвоенияШК.Видимость = Ложь;	
			ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПеремещения.Видимость= Истина;
		КонецЕсли; 
		
	Иначе
		ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПеремещения.Видимость = Истина;
		ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПрисвоенияШК.Видимость = Ложь;	
	КонецЕсли; 
	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НайстроитьСвойстваЭлементовФормы();
	
	ПолученыДанныеИзЯчейкиОткуда = Ложь;
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзЯчейки(Объект.ЯчейкаОткудаГУИД, Истина);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Закрыть();
		Возврат;
	КонецЕсли; 
	
	СписокТоваровВЯчейке.Параметры.УстановитьЗначениеПараметра("Ячейка", Параметры.ЯчейкаОткудаПоиск);
	Элементы.СписокТоваровВБуфереПеремещенияОткуда.Обновить();
	         
	//РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзЯчейки(Параметры.ЯчейкаКудаГУИД);
	//
	//Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
	//	ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
	//	Возврат;
	//КонецЕсли; 
	
	Элементы.ГруппаОткуда.Видимость = Истина;
	Элементы.ГруппаКуда.Видимость = Ложь;
	ОбновитьОписаниеШапкиФормы();
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = "Смахните влево на товаре для действия";
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_ТоварыВячейкахКуда" Тогда 
		
		Если Не ПолученыДанныеИзЯчейкиОткуда Тогда
			
			РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзЯчейки(Объект.ЯчейкаКудаГУИД, Ложь);
		
			Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
				ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
				Возврат;
			КонецЕсли; 
			
		КонецЕсли; 
	
		СписокТоваровВЯчейке.Параметры.УстановитьЗначениеПараметра("Ячейка", Параметры.ЯчейкаКудаПоиск);
		Элементы.СписокТоваровВБуфереПеремещенияКуда.Обновить();
		
		Элементы.ГруппаОткуда.Видимость = Ложь;
		Элементы.ГруппаКуда.Видимость = Истина;
		
		ПолученыДанныеИзЯчейкиОткуда = Истина;
		
		Элементы.СписокТоваровВБуфереПеремещенияОткудаСтатусПеремещено1.Видимость = Ложь;
		Элементы.СписокТоваровВБуфереПеремещенияКудаЗаглушка.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаОткуда.Видимость = Истина;
		Элементы.ГруппаКуда.Видимость = Ложь;
		
		СписокТоваровВЯчейке.Параметры.УстановитьЗначениеПараметра("Ячейка", Параметры.ЯчейкаОткудаПоиск);
		Элементы.СписокТоваровВБуфереПеремещенияОткуда.Обновить();
				
		Элементы.СписокТоваровВБуфереПеремещенияОткудаСтатусПеремещено1.Видимость = Истина;
		Элементы.СписокТоваровВБуфереПеремещенияКудаЗаглушка.Видимость = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДляПрисвоенияШК(Команда)
	
	ТоварГУИД  = Элементы.СписокТоваровВБуфереПеремещенияОткуда.ТекущиеДанные.СсылкаТовара;
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ТоварГУИД", ТоварГУИД);
	СписокПараметров.Вставить("СобытиеПрисвоитьШтрихкод", Истина);
	Закрыть( СписокПараметров );	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДляПеремещения(Команда)
	
	ТоварГУИД  = Элементы.СписокТоваровВБуфереПеремещенияОткуда.ТекущиеДанные.СсылкаТовара;
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ТоварГУИД", ТоварГУИД);
	Закрыть( СписокПараметров );	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОписаниеШапкиФормы()
	
	Результат = ОбщегоНазначения.ПолучитьОписаниеШапкиДляПеремещения(Параметры.ЯчейкаОткудаГУИД, Параметры.ЯчейкаКудаГУИД);
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + Результат.Ошибка, 4);	
		Возврат;
	КонецЕсли;
	
	ШапкаОсталосьИПеремещено.Очистить();
	СтрокаТЗ = ШапкаОсталосьИПеремещено.Добавить();
	СтрокаТЗ.КоличествоОстаток = Результат.Данные[0].КоличествоОстаток;
	СтрокаТЗ.КоличествоПеремещено = Результат.Данные[0].КоличествоПеремещено;
	СтрокаТЗ.КоличествоНабрано = Результат.Данные[0].КоличествоНабрано;
	СтрокаТЗ.ОписаниеШапки = "В ячейке ""Из"": " + Строка(СтрокаТЗ.КоличествоОстаток) + " ед.," + " набрано: " + Строка(СтрокаТЗ.КоличествоНабрано) + " ед."; 
		
КонецПроцедуры
